RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Source/gd32f10x_rcc.c
    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Get the system clock source.
  * @param  None
  * @retval Get the system clock source. The returned value can be one
  *   of the following values:
  *   @arg 0x00: HSI used as CK_SYS source
  *   @arg 0x04: HSE used as CK_SYS source
  *   @arg 0x08: PLL used as CK_SYS source
  */
uint8_t RCC_GetCK_SYSSource(void)
{
    return ((uint8_t)(RCC->GCFGR & RCC_GCFGR_SCSS));
}
/**
  * @brief  Configure the AHB clock.
  * @param  RCC_CK_SYSDiv: specify the AHB clock divider. This clock is derived from
  *   the system clock (CK_SYS).
  *   This parameter can be one of the following values:
  *   @arg RCC_SYSCLK_DIV1:   AHB clock = CK_SYS
  *   @arg RCC_SYSCLK_DIV2:   AHB clock = CK_SYS/2
  *   @arg RCC_SYSCLK_DIV4:   AHB clock = CK_SYS/4
  *   @arg RCC_SYSCLK_DIV8:   AHB clock = CK_SYS/8
  *   @arg RCC_SYSCLK_DIV16:  AHB clock = CK_SYS/16
  *   @arg RCC_SYSCLK_DIV64:  AHB clock = CK_SYS/64
  *   @arg RCC_SYSCLK_DIV128: AHB clock = CK_SYS/128
  *   @arg RCC_SYSCLK_DIV256: AHB clock = CK_SYS/256
  *   @arg RCC_SYSCLK_DIV512: AHB clock = CK_SYS/512
  * @retval None
  */
void RCC_AHBConfig(uint32_t RCC_CK_SYSDiv)
{
    uint32_t temp = 0;

    temp = RCC->GCFGR;

    /* Clear AHBPS[3:0] bits */
    temp &= ~RCC_GCFGR_AHBPS;

    /* Set AHBPS[3:0] bits according to RCC_CK_SYSDiv value */
    temp |= RCC_CK_SYSDiv;

    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Configure the APB1 clock.
  * @param  RCC_APB1: specify the APB1 clock divider. This clock is derived from
  *         the AHB clock.
  *   This parameter can be one of the following values:
  *   @arg RCC_APB1AHB_DIV1: APB1 clock = AHB
  *   @arg RCC_APB1AHB_DIV2: APB1 clock = AHB/2
  *   @arg RCC_APB1AHB_DIV4: APB1 clock = AHB/4
  *   @arg RCC_APB1AHB_DIV8: APB1 clock = AHB/8
  *   @arg RCC_APB1AHB_DIV16: APB1 clock = AHB/16
  * @retval None
  */
void RCC_APB1Config(uint32_t RCC_APB1)
{
    uint32_t temp = 0;

    temp = RCC->GCFGR;

    /* Clear APB1PS[2:0] bits */
    temp &= ~RCC_GCFGR_APB1PS;

    /* Set APB1PS[2:0] bits according to RCC_APB1 value */
    temp |= RCC_APB1;

    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Configure the APB2 clock.
  * @param  RCC_APB2: specify the APB2 clock divider. This clock is derived from
  *         the AHB clock.
  *   This parameter can be one of the following values:
  *   @arg RCC_APB2AHB_DIV1: APB2 clock = AHB
  *   @arg RCC_APB2AHB_DIV2: APB2 clock = AHB/2
  *   @arg RCC_APB2AHB_DIV4: APB2 clock = AHB/4
  *   @arg RCC_APB2AHB_DIV8: APB2 clock = AHB/8
  *   @arg RCC_APB2AHB_DIV16: APB2 clock = AHB/16
  * @retval None
  */
void RCC_APB2Config(uint32_t RCC_APB2)
{
    uint32_t temp = 0;

    temp = RCC->GCFGR;

    /* Clear APB2PS[2:0] bits */
    temp &= ~RCC_GCFGR_APB2PS;

    /* Set APB2PS[2:0] bits according to RCC_APB2 value */
    temp |= RCC_APB2;

    /* Store the new value */
    RCC->GCFGR = temp;
}

#ifdef GD32F10X_CL
/**
  * @brief  Configure the USB_OTG clock (USB_OTG CLK).
  * @param  RCC_OTGFSCLK: specify the USB_OTG clock source. This clock is derived
  *         from the PLL.
  *   This parameter can be one of the following values:
  *   @arg RCC_OTGCLK_PLL_DIV1_5: USB_OTG clock = PLL/1.5
  *   @arg RCC_OTGCLK_PLL_DIV1:   USB_OTG clock = PLL
  *   @arg RCC_OTGCLK_PLL_DIV2:   USB_OTG clock = PLL/2
  *   @arg RCC_OTGCLK_PLL_DIV2_5: USB-OTG clock = PLL/2.5
  * @retval None
  */
void RCC_OTGFSCLKConfig(uint32_t RCC_OTGFSCLK)
{

    /* Clear OTGFSPS bit */
    RCC->GCFGR &= ~RCC_GCFGR_OTGFSPS;
    /* Set OTGFSPS bits according to RCC_OTGFSCLK value */
    RCC->GCFGR |= RCC_OTGFSCLK;

}

#else
/**
  * @brief  Configure the USB clock (USBCLK).
  * @param  RCC_USBCLK: specify the USB clock source. This clock is derived
  *         from the PLL.
  *   This parameter can be one of the following values:
  *   @arg RCC_USBCLK_PLL_DIV1_5: USB clock = PLL/1.5
  *   @arg RCC_USBCLK_PLL_DIV1:   USB clock = PLL
  *   @arg RCC_USBCLK_PLL_DIV2:   USB clock = PLL/2
  *   @arg RCC_USBCLK_PLL_DIV2_5: USB clock = PLL/2.5
  * @retval None
  */
void RCC_USBCLKConfig(uint32_t RCC_USBCLK)
{

    /* Clear USBPS bit */
    RCC->GCFGR &= ~RCC_GCFGR_USBPS;
    /* Set USBPS bits according to RCC_USBCLK value */
    RCC->GCFGR |= RCC_USBCLK;

}
#endif /* GD32F10X_CL */

/**
  * @brief  Configure the ADC clock (ADCCLK).
  * @param  RCC_ADCCLK: specify the ADC clock source. This clock is derived from APB2 clock.
  *   This parameter can be one of the following values:
  *   @arg RCC_ADCCLK_APB2_DIV2: ADC clock = APB2/2
  *   @arg RCC_ADCCLK_APB2_DIV4: ADC clock = APB2/4
  *   @arg RCC_ADCCLK_APB2_DIV6: ADC clock = APB2/6
  *   @arg RCC_ADCCLK_APB2_DIV8: ADC clock = APB2/8
  *   @arg RCC_ADCCLK_APB2_DIV12: ADC clock = APB2/12
  *   @arg RCC_ADCCLK_APB2_DIV16: ADC clock = APB2/16
  * @retval None
  */
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLK)
{

    /* Clear ADCPS bit */
    RCC->GCFGR &= ~RCC_GCFGR_ADCPS;
    /* Set ADCPS bits according to RCC_APB2 value */
    RCC->GCFGR |= RCC_ADCCLK;
}

#ifdef GD32F10X_CL
/**
  * @brief  Configure the I2S2 clock source(I2S2CLK).
  * @param  RCC_I2S2CLK: specify the I2S2 clock source.
  *   This parameter can be one of the following values:
  *   @arg RCC_I2S2CLK_SYSCLK: system clock selected as I2S2 clock entry
  *   @arg RCC_I2S2CLK_PLL3: PLL3 clock selected as I2S2 clock entry
  * @note If the RCC_I2S2CLK_PLL3 selected, the I2S2 clock is (PLL3 x 2).
  * @retval None
  */
void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLK)
{
    /* Clear I2S2SEL bit */
    RCC->GCFGR2 &= ~RCC_GCFGR2_I2S2SEL;
    /* Set I2S2CLK bits according to RCC_I2S2CLK value */
    RCC->GCFGR2 |= RCC_I2S2CLK;

}

/**
  * @brief  Configure the I2S3 clock source(I2S3CLK).
  * @param  RCC_I2S3CLK: specify the I2S3 clock source.
  *   This parameter can be one of the following values:
  *   @arg RCC_I2S3CLK_SYSCLK: system clock selected as I2S3 clock entry
  *   @arg RCC_I2S3CLK_PLL3: PLL3 clock selected as I2S3 clock entry
  * @note If the RCC_I2S3CLK_PLL3 selected, the I2S3 clock is (PLL3 x 2).
  * @retval None
  */
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLK)
{
    /* Clear I2S3SEL bit */
    RCC->GCFGR2 &= ~RCC_GCFGR2_I2S3SEL;
    /* Set I2S3CLK bits according to RCC_I2S3CLK value */
    RCC->GCFGR2 |= RCC_I2S3CLK;
}
#endif /* GD32F10X_CL */

/**
  * @brief  Configure the External Low Speed oscillator (LSE).
  * @param  RCC_LSE: specify the new state of the LSE.
  *  This parameter can be one of the following values:
  *  @arg RCC_LSE_OFF: turn off the LSE
  *  @arg RCC_LSE_EN: turn on the LSE
  *  @arg RCC_LSE_BYPASS: LSE bypassed with external clock
  * @retval None
  */
void RCC_LSEConfig(uint32_t RCC_LSE)
{

    /* Reset LSEEN and LSEBPS bits before configuring the LSE */
    RCC->BDCR &= ~(RCC_BDCR_LSEEN);
    RCC->BDCR &= ~(RCC_BDCR_LSEBPS);

